GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_shrtimer.h
/* SHRTIMER_STxDMAINTEN */
#define SHRTIMER_STXDMAINTEN_CMP0IE                      BIT(0)              /*!< compare 0 interrupt enable */
#define SHRTIMER_STXDMAINTEN_CMP1IE                      BIT(1)              /*!< compare 1 interrupt enable */
#define SHRTIMER_STXDMAINTEN_CMP2IE                      BIT(2)              /*!< compare 2 interrupt enable */
#define SHRTIMER_STXDMAINTEN_CMP3IE                      BIT(3)              /*!< compare 3 interrupt enable */
#define SHRTIMER_STXDMAINTEN_REPIE                       BIT(4)              /*!< repetition interrupt enable */
#define SHRTIMER_STXDMAINTEN_UPIE                        BIT(6)              /*!< update interrupt enable */
#define SHRTIMER_STXDMAINTEN_CAP0IE                      BIT(7)              /*!< capture 0 interrupt enable */
#define SHRTIMER_STXDMAINTEN_CAP1IE                      BIT(8)              /*!< capture 1 interrupt enable */
#define SHRTIMER_STXDMAINTEN_CH0OAIE                     BIT(9)              /*!< channel 0 output active interrupt enable */
#define SHRTIMER_STXDMAINTEN_CH0ONAIE                    BIT(10)             /*!< channel 0 output inactive interrupt enable */
#define SHRTIMER_STXDMAINTEN_CH1OAIE                     BIT(11)             /*!< channel 1 output active interrupt enable */
#define SHRTIMER_STXDMAINTEN_CH1ONAIE                    BIT(12)             /*!< channel 1 output inactive interrupt enable */
#define SHRTIMER_STXDMAINTEN_RSTIE                       BIT(13)             /*!< counter reset interrupt enable */
#define SHRTIMER_STXDMAINTEN_DLYIIE                      BIT(14)             /*!< delayed IDLE mode entry interrupt enable */
#define SHRTIMER_STXDMAINTEN_CMP0DEN                     BIT(16)             /*!< compare 0 DMA request enable */
#define SHRTIMER_STXDMAINTEN_CMP1DEN                     BIT(17)             /*!< compare 1 DMA request enable */
#define SHRTIMER_STXDMAINTEN_CMP2DEN                     BIT(18)             /*!< compare 2 DMA request enable */
#define SHRTIMER_STXDMAINTEN_CMP3DEN                     BIT(19)             /*!< compare 3 DMA request enable */
#define SHRTIMER_STXDMAINTEN_REPDEN                      BIT(20)             /*!< repetition DMA request enable */
#define SHRTIMER_STXDMAINTEN_UPDEN                       BIT(22)             /*!< update DMA request enable */
#define SHRTIMER_STXDMAINTEN_CAP0DEN                     BIT(23)             /*!< capture 0 DMA request enable */
#define SHRTIMER_STXDMAINTEN_CAP1DEN                     BIT(24)             /*!< capture 1 DMA request enable */
#define SHRTIMER_STXDMAINTEN_CH0OADEN                    BIT(25)             /*!< channel 0 output active DMA request enable */
#define SHRTIMER_STXDMAINTEN_CH0ONADEN                   BIT(26)             /*!< channel 0 output inactive DMA request enable */
#define SHRTIMER_STXDMAINTEN_CH1OADEN                    BIT(27)             /*!< channel 1 output active DMA request enable */
#define SHRTIMER_STXDMAINTEN_CH1ONADEN                   BIT(28)             /*!< channel 1 output inactive DMA request enable */
#define SHRTIMER_STXDMAINTEN_RSTDEN                      BIT(29)             /*!< counter reset DMA request enable */
#define SHRTIMER_STXDMAINTEN_DLYIDEN                     BIT(30)             /*!< delayed IDLE mode entry DMA request enable */

/* SHRTIMER_STxCNT */
#define SHRTIMER_STXCNT_CNT                              BITS(0,15)          /*!< the current counter value */

/* SHRTIMER_STxCAR */
#define SHRTIMER_STXCAR_CARL                             BITS(0,15)          /*!< counter auto reload value */

/* SHRTIMER_STxCREP */
#define SHRTIMER_STXCREP_CREP                            BITS(0,7)           /*!< counter repetition value */

/* SHRTIMER_STxCMP0V */
#define SHRTIMER_STXCMP0V_CMP0VAL                        BITS(0,15)          /*!< compare 0 value */

/* SHRTIMER_STxCMP0CP */
#define SHRTIMER_STXCMP0CP_CMP0VAL                       BITS(0,15)          /*!< compare 0 value */
#define SHRTIMER_STXCMP0CP_CREP                          BITS(16,23)         /*!< counter repetition value */

/* SHRTIMER_STxCMP1V */
#define SHRTIMER_STXCMP1V_CMP1VAL                        BITS(0,15)          /*!< compare 1 value */

/* SHRTIMER_STxCMP2V */
#define SHRTIMER_STXCMP2V_CMP2VAL                        BITS(0,15)          /*!< compare 2 value */

/* SHRTIMER_STxCMP3V */
#define SHRTIMER_STXCMP3V_CMP3VAL                        BITS(0,15)          /*!< compare 3 value */

/* SHRTIMER_STxCAP0V */
#define SHRTIMER_STXCAP0V_CAP0VAL                        BITS(0,15)          /*!< capture 0 value */

/* SHRTIMER_STxCAP1V */
#define SHRTIMER_STXCAP1V_CAP1VAL                        BITS(0,15)          /*!< capture 1 value */

/* SHRTIMER_STxDTCTL */
#define SHRTIMER_STXDTCTL_DTRCFG8_0                      BITS(0,8)           /*!< rising edge dead-time value */
#define SHRTIMER_STXDTCTL_DTRS                           BIT(9)              /*!< the sign of rising edge dead-time value */
#define SHRTIMER_STXDTCTL_DTGCKDIV                       BITS(10,13)         /*!< dead time generator clock division */
#define SHRTIMER_STXDTCTL_DTRSPROT                       BIT(14)             /*!< dead-time rising edge protection for sign */
#define SHRTIMER_STXDTCTL_DTRSVPROT                      BIT(15)             /*!< dead-time rising edge protection for value and sign */
#define SHRTIMER_STXDTCTL_DTFCFG8_0                      BITS(16,24)         /*!< falling edge dead-time value */
#define SHRTIMER_STXDTCTL_DTFS                           BIT(25)             /*!< the sign of falling edge dead-time value */
#define SHRTIMER_STXDTCTL_DTFSPROT                       BIT(30)             /*!< dead-time falling edge protection for sign */
#define SHRTIMER_STXDTCTL_DTFSVPROT                      BIT(31)             /*!< dead-time falling edge protection for value and sign */

/* SHRTIMER_STxCH0SET */
#define SHRTIMER_STXCH0SET_CH0SSEV                       BIT(0)              /*!< software event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SRST                       BIT(1)              /*!< Slave_TIMERx reset event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SPER                       BIT(2)              /*!< Slave_TIMERx period event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SCMP0                      BIT(3)              /*!< Slave_TIMERx compare 0 event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SCMP1                      BIT(4)              /*!< Slave_TIMERx compare 1 event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SCMP2                      BIT(5)              /*!< Slave_TIMERx compare 2 event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SCMP3                      BIT(6)              /*!< Slave_TIMERx compare 3 event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SMTPER                     BIT(7)              /*!< Master_TIMER period event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SMTCMP0                    BIT(8)              /*!< Master_TIMER compare 0 event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SMTCMP1                    BIT(9)              /*!< Master_TIMER compare 1 event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SMTCMP2                    BIT(10)             /*!< Master_TIMER compare 2 event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SMTCMP3                    BIT(11)             /*!< Master_TIMER compare 3 event generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SSTEV0                     BIT(12)             /*!< Slave_TIMERx interconnection event 0 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SSTEV1                     BIT(13)             /*!< Slave_TIMERx interconnection event 1 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SSTEV2                     BIT(14)             /*!< Slave_TIMERx interconnection event 2 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SSTEV3                     BIT(15)             /*!< Slave_TIMERx interconnection event 3 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SSTEV4                     BIT(16)             /*!< Slave_TIMERx interconnection event 4 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SSTEV5                     BIT(17)             /*!< Slave_TIMERx interconnection event 5 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SSTEV6                     BIT(18)             /*!< Slave_TIMERx interconnection event 6 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SSTEV7                     BIT(19)             /*!< Slave_TIMERx interconnection event 7 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SSTEV8                     BIT(20)             /*!< Slave_TIMERx interconnection event 8 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV0                     BIT(21)             /*!< external event 0 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV1                     BIT(22)             /*!< external event 1 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV2                     BIT(23)             /*!< external event 2 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV3                     BIT(24)             /*!< external event 3 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV4                     BIT(25)             /*!< external event 4 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV5                     BIT(26)             /*!< external event 5 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV6                     BIT(27)             /*!< external event 6 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV7                     BIT(28)             /*!< external event 7 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV8                     BIT(29)             /*!< external event 8 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SEXEV9                     BIT(30)             /*!< external event 9 generates channel 0 set request */
#define SHRTIMER_STXCH0SET_CH0SUP                        BIT(31)             /*!< update event generates channel 0 set request */

/* SHRTIMER_STxCH0RST */
#define SHRTIMER_STXCH0RST_CH0RSSEV                      BIT(0)              /*!< software event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSRST                      BIT(1)              /*!< Slave_TIMERx reset event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSPER                      BIT(2)              /*!< Slave_TIMERx period event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSCMP0                     BIT(3)              /*!< Slave_TIMERx compare 0 event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSCMP1                     BIT(4)              /*!< Slave_TIMERx compare 1 event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSCMP2                     BIT(5)              /*!< Slave_TIMERx compare 2 event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSCMP3                     BIT(6)              /*!< Slave_TIMERx compare 3 event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSMTPER                    BIT(7)              /*!< Master_TIMER period event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSMTCMP0                   BIT(8)              /*!< Master_TIMER compare 0 event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSMTCMP1                   BIT(9)              /*!< Master_TIMER compare 1 event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSMTCMP2                   BIT(10)             /*!< Master_TIMER compare 2 event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSMTCMP3                   BIT(11)             /*!< Master_TIMER compare 3 event generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSSTEV0                    BIT(12)             /*!< Slave_TIMERx interconnection event 0 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSSTEV1                    BIT(13)             /*!< Slave_TIMERx interconnection event 1 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSSTEV2                    BIT(14)             /*!< Slave_TIMERx interconnection event 2 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSSTEV3                    BIT(15)             /*!< Slave_TIMERx interconnection event 3 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSSTEV4                    BIT(16)             /*!< Slave_TIMERx interconnection event 4 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSSTEV5                    BIT(17)             /*!< Slave_TIMERx interconnection event 5 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSSTEV6                    BIT(18)             /*!< Slave_TIMERx interconnection event 6 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSSTEV7                    BIT(19)             /*!< Slave_TIMERx interconnection event 7 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSSTEV8                    BIT(20)             /*!< Slave_TIMERx interconnection event 8 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV0                    BIT(21)             /*!< external event 0 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV1                    BIT(22)             /*!< external event 1 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV2                    BIT(23)             /*!< external event 2 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV3                    BIT(24)             /*!< external event 3 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV4                    BIT(25)             /*!< external event 4 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV5                    BIT(26)             /*!< external event 5 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV6                    BIT(27)             /*!< external event 6 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV7                    BIT(28)             /*!< external event 7 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV8                    BIT(29)             /*!< external event 8 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSEXEV9                    BIT(30)             /*!< external event 9 generates channel 0 reset request */
#define SHRTIMER_STXCH0RST_CH0RSUP                       BIT(31)             /*!< update event generates channel 0 reset request */

/* SHRTIMER_STxCH1SET */
#define SHRTIMER_STXCH1SET_CH1SSEV                       BIT(0)              /*!< software event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SRST                       BIT(1)              /*!< Slave_TIMERx reset event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SPER                       BIT(2)              /*!< Slave_TIMERx period event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SCMP0                      BIT(3)              /*!< Slave_TIMERx compare 0 event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SCMP1                      BIT(4)              /*!< Slave_TIMERx compare 1 event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SCMP2                      BIT(5)              /*!< Slave_TIMERx compare 2 event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SCMP3                      BIT(6)              /*!< Slave_TIMERx compare 3 event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SMTPER                     BIT(7)              /*!< Master_TIMER period event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SMTCMP0                    BIT(8)              /*!< Master_TIMER compare 0 event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SMTCMP1                    BIT(9)              /*!< Master_TIMER compare 1 event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SMTCMP2                    BIT(10)             /*!< Master_TIMER compare 2 event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SMTCMP3                    BIT(11)             /*!< Master_TIMER compare 3 event generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SSTEV0                     BIT(12)             /*!< Slave_TIMERx interconnection event 0 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SSTEV1                     BIT(13)             /*!< Slave_TIMERx interconnection event 1 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SSTEV2                     BIT(14)             /*!< Slave_TIMERx interconnection event 2 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SSTEV3                     BIT(15)             /*!< Slave_TIMERx interconnection event 3 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SSTEV4                     BIT(16)             /*!< Slave_TIMERx interconnection event 4 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SSTEV5                     BIT(17)             /*!< Slave_TIMERx interconnection event 5 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SSTEV6                     BIT(18)             /*!< Slave_TIMERx interconnection event 6 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SSTEV7                     BIT(19)             /*!< Slave_TIMERx interconnection event 7 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SSTEV8                     BIT(20)             /*!< Slave_TIMERx interconnection event 8 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV0                     BIT(21)             /*!< external event 0 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV1                     BIT(22)             /*!< external event 1 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV2                     BIT(23)             /*!< external event 2 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV3                     BIT(24)             /*!< external event 3 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV4                     BIT(25)             /*!< external event 4 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV5                     BIT(26)             /*!< external event 5 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV6                     BIT(27)             /*!< external event 6 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV7                     BIT(28)             /*!< external event 7 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV8                     BIT(29)             /*!< external event 8 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SEXEV9                     BIT(30)             /*!< external event 9 generates channel 1 set request */
#define SHRTIMER_STXCH1SET_CH1SUP                        BIT(31)             /*!< update event generates channel 1 set request */

