GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_shrtimer.h
/* SHRTIMER_STxCNTRST */
#define SHRTIMER_STXCNTRST_UPRST                         BIT(1)              /*!< Slave_TIMER0 update event resets counter */
#define SHRTIMER_STXCNTRST_CMP1RST                       BIT(2)              /*!< Slave_TIMER0 compare 1 event resets counter */
#define SHRTIMER_STXCNTRST_CMP3RST                       BIT(3)              /*!< Slave_TIMER0 compare 3 event resets counter */
#define SHRTIMER_STXCNTRST_MTPERRST                      BIT(4)              /*!< Master_TIMER period event resets counter */
#define SHRTIMER_STXCNTRST_MTCMP0RST                     BIT(5)              /*!< Master_TIMER compare 0 event resets counter */
#define SHRTIMER_STXCNTRST_MTCMP1RST                     BIT(6)              /*!< Master_TIMER compare 1 event resets counter */
#define SHRTIMER_STXCNTRST_MTCMP2RST                     BIT(7)              /*!< Master_TIMER compare 2 event resets counter */
#define SHRTIMER_STXCNTRST_MTCMP3RST                     BIT(8)              /*!< Master_TIMER compare 3 event resets counter */
#define SHRTIMER_STXCNTRST_EXEV0RST                      BIT(9)              /*!< external event 0 resets counter */
#define SHRTIMER_STXCNTRST_EXEV1RST                      BIT(10)             /*!< external event 1 resets counter */
#define SHRTIMER_STXCNTRST_EXEV2RST                      BIT(11)             /*!< external event 2 resets counter */
#define SHRTIMER_STXCNTRST_EXEV3RST                      BIT(12)             /*!< external event 3 resets counter */
#define SHRTIMER_STXCNTRST_EXEV4RST                      BIT(13)             /*!< external event 4 resets counter */
#define SHRTIMER_STXCNTRST_EXEV5RST                      BIT(14)             /*!< external event 5 resets counter */
#define SHRTIMER_STXCNTRST_EXEV6RST                      BIT(15)             /*!< external event 6 resets counter */
#define SHRTIMER_STXCNTRST_EXEV7RST                      BIT(16)             /*!< external event 7 resets counter */
#define SHRTIMER_STXCNTRST_EXEV8RST                      BIT(17)             /*!< external event 8 resets counter */
#define SHRTIMER_STXCNTRST_EXEV9RST                      BIT(18)             /*!< external event 9 resets counter */
/* For Slave_TIMER0 */
#define SHRTIMER_ST0CNTRST_ST1CMP0RST                    BIT(19)             /*!< Slave_TIMER1 compare 0 event resets counter */
#define SHRTIMER_ST0CNTRST_ST1CMP1RST                    BIT(20)             /*!< Slave_TIMER1 compare 1 event resets counter */
#define SHRTIMER_ST0CNTRST_ST1CMP3RST                    BIT(21)             /*!< Slave_TIMER1 compare 3 event resets counter */
#define SHRTIMER_ST0CNTRST_ST2CMP0RST                    BIT(22)             /*!< Slave_TIMER2 compare 0 event resets counter */
#define SHRTIMER_ST0CNTRST_ST2CMP1RST                    BIT(23)             /*!< Slave_TIMER2 compare 1 event resets counter */
#define SHRTIMER_ST0CNTRST_ST2CMP3RST                    BIT(24)             /*!< Slave_TIMER2 compare 3 event resets counter */
#define SHRTIMER_ST0CNTRST_ST3CMP0RST                    BIT(25)             /*!< Slave_TIMER3 compare 0 event resets counter */
#define SHRTIMER_ST0CNTRST_ST3CMP1RST                    BIT(26)             /*!< Slave_TIMER3 compare 1 event resets counter */
#define SHRTIMER_ST0CNTRST_ST3CMP3RST                    BIT(27)             /*!< Slave_TIMER3 compare 3 event resets counter */
#define SHRTIMER_ST0CNTRST_ST4CMP0RST                    BIT(28)             /*!< Slave_TIMER4 compare 0 event resets counter */
#define SHRTIMER_ST0CNTRST_ST4CMP1RST                    BIT(29)             /*!< Slave_TIMER4 compare 1 event resets counter */
#define SHRTIMER_ST0CNTRST_ST4CMP3RST                    BIT(30)             /*!< Slave_TIMER4 compare 3 event resets counter */
/* For Slave_TIMER1 */
#define SHRTIMER_ST1CNTRST_ST0CMP0RST                    BIT(19)             /*!< Slave_TIMER0 compare 0 event resets counter */
#define SHRTIMER_ST1CNTRST_ST0CMP1RST                    BIT(20)             /*!< Slave_TIMER0 compare 1 event resets counter */
#define SHRTIMER_ST1CNTRST_ST0CMP3RST                    BIT(21)             /*!< Slave_TIMER0 compare 3 event resets counter */
#define SHRTIMER_ST1CNTRST_ST2CMP0RST                    BIT(22)             /*!< Slave_TIMER2 compare 0 event resets counter */
#define SHRTIMER_ST1CNTRST_ST2CMP1RST                    BIT(23)             /*!< Slave_TIMER2 compare 1 event resets counter */
#define SHRTIMER_ST1CNTRST_ST2CMP3RST                    BIT(24)             /*!< Slave_TIMER2 compare 3 event resets counter */
#define SHRTIMER_ST1CNTRST_ST3CMP0RST                    BIT(25)             /*!< Slave_TIMER3 compare 0 event resets counter */
#define SHRTIMER_ST1CNTRST_ST3CMP1RST                    BIT(26)             /*!< Slave_TIMER3 compare 1 event resets counter */
#define SHRTIMER_ST1CNTRST_ST3CMP3RST                    BIT(27)             /*!< Slave_TIMER3 compare 3 event resets counter */
#define SHRTIMER_ST1CNTRST_ST4CMP0RST                    BIT(28)             /*!< Slave_TIMER4 compare 0 event resets counter */
#define SHRTIMER_ST1CNTRST_ST4CMP1RST                    BIT(29)             /*!< Slave_TIMER4 compare 1 event resets counter */
#define SHRTIMER_ST1CNTRST_ST4CMP3RST                    BIT(30)             /*!< Slave_TIMER4 compare 3 event resets counter */
/* For Slave_TIMER2 */
#define SHRTIMER_ST2CNTRST_ST0CMP0RST                    BIT(19)             /*!< Slave_TIMER0 compare 0 event resets counter */
#define SHRTIMER_ST2CNTRST_ST0CMP1RST                    BIT(20)             /*!< Slave_TIMER0 compare 1 event resets counter */
#define SHRTIMER_ST2CNTRST_ST0CMP3RST                    BIT(21)             /*!< Slave_TIMER0 compare 3 event resets counter */
#define SHRTIMER_ST2CNTRST_ST1CMP0RST                    BIT(22)             /*!< Slave_TIMER1 compare 0 event resets counter */
#define SHRTIMER_ST2CNTRST_ST1CMP1RST                    BIT(23)             /*!< Slave_TIMER1 compare 1 event resets counter */
#define SHRTIMER_ST2CNTRST_ST1CMP3RST                    BIT(24)             /*!< Slave_TIMER1 compare 3 event resets counter */
#define SHRTIMER_ST2CNTRST_ST3CMP0RST                    BIT(25)             /*!< Slave_TIMER3 compare 0 event resets counter */
#define SHRTIMER_ST2CNTRST_ST3CMP1RST                    BIT(26)             /*!< Slave_TIMER3 compare 1 event resets counter */
#define SHRTIMER_ST2CNTRST_ST3CMP3RST                    BIT(27)             /*!< Slave_TIMER3 compare 3 event resets counter */
#define SHRTIMER_ST2CNTRST_ST4CMP0RST                    BIT(28)             /*!< Slave_TIMER4 compare 0 event resets counter */
#define SHRTIMER_ST2CNTRST_ST4CMP1RST                    BIT(29)             /*!< Slave_TIMER4 compare 1 event resets counter */
#define SHRTIMER_ST2CNTRST_ST4CMP3RST                    BIT(30)             /*!< Slave_TIMER4 compare 3 event resets counter */
/* For Slave_TIMER3 */
#define SHRTIMER_ST3CNTRST_ST0CMP0RST                    BIT(19)             /*!< Slave_TIMER0 compare 0 event resets counter */
#define SHRTIMER_ST3CNTRST_ST0CMP1RST                    BIT(20)             /*!< Slave_TIMER0 compare 1 event resets counter */
#define SHRTIMER_ST3CNTRST_ST0CMP3RST                    BIT(21)             /*!< Slave_TIMER0 compare 3 event resets counter */
#define SHRTIMER_ST3CNTRST_ST1CMP0RST                    BIT(22)             /*!< Slave_TIMER1 compare 0 event resets counter */
#define SHRTIMER_ST3CNTRST_ST1CMP1RST                    BIT(23)             /*!< Slave_TIMER1 compare 1 event resets counter */
#define SHRTIMER_ST3CNTRST_ST1CMP3RST                    BIT(24)             /*!< Slave_TIMER1 compare 3 event resets counter */
#define SHRTIMER_ST3CNTRST_ST2CMP0RST                    BIT(25)             /*!< Slave_TIMER2 compare 0 event resets counter */
#define SHRTIMER_ST3CNTRST_ST2CMP1RST                    BIT(26)             /*!< Slave_TIMER2 compare 1 event resets counter */
#define SHRTIMER_ST3CNTRST_ST2CMP3RST                    BIT(27)             /*!< Slave_TIMER2 compare 3 event resets counter */
#define SHRTIMER_ST3CNTRST_ST4CMP0RST                    BIT(28)             /*!< Slave_TIMER4 compare 0 event resets counter */
#define SHRTIMER_ST3CNTRST_ST4CMP1RST                    BIT(29)             /*!< Slave_TIMER4 compare 1 event resets counter */
#define SHRTIMER_ST3CNTRST_ST4CMP3RST                    BIT(30)             /*!< Slave_TIMER4 compare 3 event resets counter */
/* For Slave_TIMER4 */
#define SHRTIMER_ST4CNTRST_ST0CMP0RST                    BIT(19)             /*!< Slave_TIMER0 compare 0 event resets counter */
#define SHRTIMER_ST4CNTRST_ST0CMP1RST                    BIT(20)             /*!< Slave_TIMER0 compare 1 event resets counter */
#define SHRTIMER_ST4CNTRST_ST0CMP3RST                    BIT(21)             /*!< Slave_TIMER0 compare 3 event resets counter */
#define SHRTIMER_ST4CNTRST_ST1CMP0RST                    BIT(22)             /*!< Slave_TIMER1 compare 0 event resets counter */
#define SHRTIMER_ST4CNTRST_ST1CMP1RST                    BIT(23)             /*!< Slave_TIMER1 compare 1 event resets counter */
#define SHRTIMER_ST4CNTRST_ST1CMP3RST                    BIT(24)             /*!< Slave_TIMER1 compare 3 event resets counter */
#define SHRTIMER_ST4CNTRST_ST2CMP0RST                    BIT(25)             /*!< Slave_TIMER2 compare 0 event resets counter */
#define SHRTIMER_ST4CNTRST_ST2CMP1RST                    BIT(26)             /*!< Slave_TIMER2 compare 1 event resets counter */
#define SHRTIMER_ST4CNTRST_ST2CMP3RST                    BIT(27)             /*!< Slave_TIMER2 compare 3 event resets counter */
#define SHRTIMER_ST4CNTRST_ST3CMP0RST                    BIT(28)             /*!< Slave_TIMER3 compare 0 event resets counter */
#define SHRTIMER_ST4CNTRST_ST3CMP1RST                    BIT(29)             /*!< Slave_TIMER3 compare 1 event resets counter */
#define SHRTIMER_ST4CNTRST_ST3CMP3RST                    BIT(30)             /*!< Slave_TIMER3 compare 3 event resets counter */

/* SHRTIMER_STxCSCTL */
#define SHRTIMER_STXCSCTL_CSPRD                          BITS(0,3)           /*!< carrier signal period */
#define SHRTIMER_STXCSCTL_CSDTY                          BITS(4,6)           /*!< carrier signal duty cycle */
#define SHRTIMER_STXCSCTL_CSFSTPW                        BITS(7,10)          /*!< first carrier-signal pulse width */

