GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_shrtimer.h
/* SHRTIMER_STxFLTCTL */
#define SHRTIMER_STXFLTCTL_FLT0EN                        BIT(0)              /*!< fault 0 enable */
#define SHRTIMER_STXFLTCTL_FLT1EN                        BIT(1)              /*!< fault 1 enable */
#define SHRTIMER_STXFLTCTL_FLT2EN                        BIT(2)              /*!< fault 2 enable */
#define SHRTIMER_STXFLTCTL_FLT3EN                        BIT(3)              /*!< fault 3 enable */
#define SHRTIMER_STXFLTCTL_FLT4EN                        BIT(4)              /*!< fault 4 enable */
#define SHRTIMER_STXFLTCTL_FLTENPROT                     BIT(31)             /*!< protect fault enable */

/* SHRTIMER_STxACTL */
#define SHRTIMER_STXACTL_CNTCKDIV3                       BIT(3)              /*!< counter clock division */
#define SHRTIMER_STXACTL_DTRCFG15_9                      BITS(9,15)          /*!< rising edge dead-time value configure */
#define SHRTIMER_STXACTL_DTFCFG15_9                      BITS(25,31)         /*!< falling edge dead-time value configure */

/* Common registers */
/* SHRTIMER_CTL0 */
#define SHRTIMER_CTL0_MTUPDIS                            BIT(0)              /*!< Master_TIMER update disable */
#define SHRTIMER_CTL0_ST0UPDIS                           BIT(1)              /*!< Slave_TIMER0 update disable */
#define SHRTIMER_CTL0_ST1UPDIS                           BIT(2)              /*!< Slave_TIMER1 update disable */
#define SHRTIMER_CTL0_ST2UPDIS                           BIT(3)              /*!< Slave_TIMER2 update disable */
#define SHRTIMER_CTL0_ST3UPDIS                           BIT(4)              /*!< Slave_TIMER3 update disable */
#define SHRTIMER_CTL0_ST4UPDIS                           BIT(5)              /*!< Slave_TIMER4 update disable */
#define SHRTIMER_CTL0_ADTG0USRC                          BITS(16,18)         /*!< SHRTIMER_ADCTRIG0 update source */
#define SHRTIMER_CTL0_ADTG1USRC                          BITS(19,21)         /*!< SHRTIMER_ADCTRIG1 update source */
#define SHRTIMER_CTL0_ADTG2USRC                          BITS(22,24)         /*!< SHRTIMER_ADCTRIG2 update source */
#define SHRTIMER_CTL0_ADTG3USRC                          BITS(25,27)         /*!< SHRTIMER_ADCTRIG3 update source */

/* SHRTIMER_CTL1 */
#define SHRTIMER_CTL1_MTSUP                              BIT(0)              /*!< Master_TIMER software update */
#define SHRTIMER_CTL1_ST0SUP                             BIT(1)              /*!< Slave_TIMER0 software update */
#define SHRTIMER_CTL1_ST1SUP                             BIT(2)              /*!< Slave_TIMER1 software update */
#define SHRTIMER_CTL1_ST2SUP                             BIT(3)              /*!< Slave_TIMER2 software update */
#define SHRTIMER_CTL1_ST3SUP                             BIT(4)              /*!< Slave_TIMER3 software update */
#define SHRTIMER_CTL1_ST4SUP                             BIT(5)              /*!< Slave_TIMER4 software update */
#define SHRTIMER_CTL1_MTSRST                             BIT(8)              /*!< Master_TIMER software reset */
#define SHRTIMER_CTL1_ST0SRST                            BIT(9)              /*!< Slave_TIMER0 software reset */
#define SHRTIMER_CTL1_ST1SRST                            BIT(10)             /*!< Slave_TIMER1 software reset */
#define SHRTIMER_CTL1_ST2SRST                            BIT(11)             /*!< Slave_TIMER2 software reset */
#define SHRTIMER_CTL1_ST3SRST                            BIT(12)             /*!< Slave_TIMER3 software reset */
#define SHRTIMER_CTL1_ST4SRST                            BIT(13)             /*!< Slave_TIMER4 software reset */

/* SHRTIMER_INTF */
#define SHRTIMER_INTF_FLT0IF                             BIT(0)              /*!< fault 0 interrupt flag */
#define SHRTIMER_INTF_FLT1IF                             BIT(1)              /*!< fault 1 interrupt flag */
#define SHRTIMER_INTF_FLT2IF                             BIT(2)              /*!< fault 2 interrupt flag */
#define SHRTIMER_INTF_FLT3IF                             BIT(3)              /*!< fault 3 interrupt flag */
#define SHRTIMER_INTF_FLT4IF                             BIT(4)              /*!< fault 4 interrupt flag */
#define SHRTIMER_INTF_SYSFLTIF                           BIT(5)              /*!< system fault interrupt flag */
#define SHRTIMER_INTF_DLLCALIF                           BIT(16)             /*!< DLL calibration completed interrupt flag */
#define SHRTIMER_INTF_BMPERIF                            BIT(17)             /*!< bunch mode period interrupt flag */

/* SHRTIMER_INTC */
#define SHRTIMER_INTC_FLT0IFC                            BIT(0)              /*!< clear fault 0 interrupt flag */
#define SHRTIMER_INTC_FLT1IFC                            BIT(1)              /*!< clear fault 1 interrupt flag */
#define SHRTIMER_INTC_FLT2IFC                            BIT(2)              /*!< clear fault 2 interrupt flag */
#define SHRTIMER_INTC_FLT3IFC                            BIT(3)              /*!< clear fault 3 interrupt flag */
#define SHRTIMER_INTC_FLT4IFC                            BIT(4)              /*!< clear fault 4 interrupt flag */
#define SHRTIMER_INTC_SYSFLTIFC                          BIT(5)              /*!< clear system fault interrupt flag */
#define SHRTIMER_INTC_DLLCALIFC                          BIT(16)             /*!< clear DLL calibration completed interrupt flag */
#define SHRTIMER_INTC_BMPERIFC                           BIT(17)             /*!< clear bunch mode period interrupt flag */

/* SHRTIMER_INTEN */
#define SHRTIMER_INTEN_FLT0IE                            BIT(0)              /*!< fault 0 interrupt enable */
#define SHRTIMER_INTEN_FLT1IE                            BIT(1)              /*!< fault 1 interrupt enable */
#define SHRTIMER_INTEN_FLT2IE                            BIT(2)              /*!< fault 2 interrupt enable */
#define SHRTIMER_INTEN_FLT3IE                            BIT(3)              /*!< fault 3 interrupt enable */
#define SHRTIMER_INTEN_FLT4IE                            BIT(4)              /*!< fault 4 interrupt enable */
#define SHRTIMER_INTEN_SYSFLTIE                          BIT(5)              /*!< system fault interrupt enable */
#define SHRTIMER_INTEN_DLLCALIE                          BIT(16)             /*!< DLL calibration completed interrupt enable */
#define SHRTIMER_INTEN_BMPERIE                           BIT(17)             /*!< bunch mode period interrupt enable */

/* SHRTIMER_CHOUTEN */
#define SHRTIMER_CHOUTEN_ST0CH0EN                        BIT(0)              /*!< Slave_TIMER0 channel 0 output (ST0CH0_O) enable */
#define SHRTIMER_CHOUTEN_ST0CH1EN                        BIT(1)              /*!< Slave_TIMER0 channel 1 output (ST0CH1_O) enable */
#define SHRTIMER_CHOUTEN_ST1CH0EN                        BIT(2)              /*!< Slave_TIMER1 channel 0 output (ST1CH0_O) enable */
#define SHRTIMER_CHOUTEN_ST1CH1EN                        BIT(3)              /*!< Slave_TIMER1 channel 1 output (ST1CH1_O) enable */
#define SHRTIMER_CHOUTEN_ST2CH0EN                        BIT(4)              /*!< Slave_TIMER2 channel 0 output (ST2CH0_O) enable */
#define SHRTIMER_CHOUTEN_ST2CH1EN                        BIT(5)              /*!< Slave_TIMER2 channel 1 output (ST2CH1_O) enable */
#define SHRTIMER_CHOUTEN_ST3CH0EN                        BIT(6)              /*!< Slave_TIMER3 channel 0 output (ST3CH0_O) enable */
#define SHRTIMER_CHOUTEN_ST3CH1EN                        BIT(7)              /*!< Slave_TIMER3 channel 1 output (ST3CH1_O) enable */
#define SHRTIMER_CHOUTEN_ST4CH0EN                        BIT(8)              /*!< Slave_TIMER4 channel 0 output (ST4CH0_O) enable */
#define SHRTIMER_CHOUTEN_ST4CH1EN                        BIT(9)              /*!< Slave_TIMER4 channel 1 output (ST4CH1_O) enable */

/* SHRTIMER_CHOUTDIS */
#define SHRTIMER_CHOUTDIS_ST0CH0DIS                      BIT(0)              /*!< Slave_TIMER0 channel 0 output (ST0CH0_O) disable */
#define SHRTIMER_CHOUTDIS_ST0CH1DIS                      BIT(1)              /*!< Slave_TIMER0 channel 1 output (ST0CH1_O) disable */
#define SHRTIMER_CHOUTDIS_ST1CH0DIS                      BIT(2)              /*!< Slave_TIMER1 channel 0 output (ST1CH0_O) disable */
#define SHRTIMER_CHOUTDIS_ST1CH1DIS                      BIT(3)              /*!< Slave_TIMER1 channel 1 output (ST1CH1_O) disable */
#define SHRTIMER_CHOUTDIS_ST2CH0DIS                      BIT(4)              /*!< Slave_TIMER2 channel 0 output (ST2CH0_O) disable */
#define SHRTIMER_CHOUTDIS_ST2CH1DIS                      BIT(5)              /*!< Slave_TIMER2 channel 1 output (ST2CH1_O) disable */
#define SHRTIMER_CHOUTDIS_ST3CH0DIS                      BIT(6)              /*!< Slave_TIMER3 channel 0 output (ST3CH0_O) disable */
#define SHRTIMER_CHOUTDIS_ST3CH1DIS                      BIT(7)              /*!< Slave_TIMER3 channel 1 output (ST3CH1_O) disable */
#define SHRTIMER_CHOUTDIS_ST4CH0DIS                      BIT(8)              /*!< Slave_TIMER4 channel 0 output (ST4CH0_O) disable */
#define SHRTIMER_CHOUTDIS_ST4CH1DIS                      BIT(9)              /*!< Slave_TIMER4 channel 1 output (ST4CH1_O) disable */

/* SHRTIMER_CHOUTDISF */
#define SHRTIMER_CHOUTDISF_ST0CH0DISF                    BIT(0)              /*!< Slave_TIMER0 channel 0 output (ST0CH0_O) disable flag */
#define SHRTIMER_CHOUTDISF_ST0CH1DISF                    BIT(1)              /*!< Slave_TIMER0 channel 1 output (ST0CH1_O) disable flag */
#define SHRTIMER_CHOUTDISF_ST1CH0DISF                    BIT(2)              /*!< Slave_TIMER1 channel 0 output (ST1CH0_O) disable flag */
#define SHRTIMER_CHOUTDISF_ST1CH1DISF                    BIT(3)              /*!< Slave_TIMER1 channel 1 output (ST1CH1_O) disable flag */
#define SHRTIMER_CHOUTDISF_ST2CH0DISF                    BIT(4)              /*!< Slave_TIMER2 channel 0 output (ST2CH0_O) disable flag */
#define SHRTIMER_CHOUTDISF_ST2CH1DISF                    BIT(5)              /*!< Slave_TIMER2 channel 1 output (ST2CH1_O) disable flag */
#define SHRTIMER_CHOUTDISF_ST3CH0DISF                    BIT(6)              /*!< Slave_TIMER3 channel 0 output (ST3CH0_O) disable flag */
#define SHRTIMER_CHOUTDISF_ST3CH1DISF                    BIT(7)              /*!< Slave_TIMER3 channel 1 output (ST3CH1_O) disable flag */
#define SHRTIMER_CHOUTDISF_ST4CH0DISF                    BIT(8)              /*!< Slave_TIMER4 channel 0 output (ST4CH0_O) disable flag */
#define SHRTIMER_CHOUTDISF_ST4CH1DISF                    BIT(9)              /*!< Slave_TIMER4 channel 1 output (ST4CH1_O) disable flag */

