GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_shrtimer.h
/* SHRTIMER_BMCTL */
#define SHRTIMER_BMCTL_BMEN                              BIT(0)              /*!< bunch mode enable */
#define SHRTIMER_BMCTL_BMCTN                             BIT(1)              /*!< continuous mode in bunch mode */
#define SHRTIMER_BMCTL_BMCLKS                            BITS(2,5)           /*!< bunch mode clock source */
#define SHRTIMER_BMCTL_BMPSC                             BITS(6,9)           /*!< bunch mode clock division */
#define SHRTIMER_BMCTL_BMSE                              BIT(10)             /*!< bunch mode shadow enable */
#define SHRTIMER_BMCTL_BMMT                              BIT(16)             /*!< Master_TIMER bunch mode */
#define SHRTIMER_BMCTL_BMST0                             BIT(17)             /*!< Slave_TIMER0 bunch mode */
#define SHRTIMER_BMCTL_BMST1                             BIT(18)             /*!< Slave_TIMER1 bunch mode */
#define SHRTIMER_BMCTL_BMST2                             BIT(19)             /*!< Slave_TIMER2 bunch mode */
#define SHRTIMER_BMCTL_BMST3                             BIT(20)             /*!< Slave_TIMER3 bunch mode */
#define SHRTIMER_BMCTL_BMST4                             BIT(21)             /*!< Slave_TIMER4 bunch mode */
#define SHRTIMER_BMCTL_BMOPTF                            BIT(31)             /*!< bunch mode operating flag */

/* SHRTIMER_BMSTRG */
#define SHRTIMER_BMSTRG_SWTRG                            BIT(0)              /*!< software triggers bunch mode operation */
#define SHRTIMER_BMSTRG_MTRST                            BIT(1)              /*!< Master_TIMER reset event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_MTREP                            BIT(2)              /*!< Master_TIMER repetition event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_MTCMP0                           BIT(3)              /*!< Master_TIMER compare 0 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_MTCMP1                           BIT(4)              /*!< Master_TIMER compare 1 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_MTCMP2                           BIT(5)              /*!< Master_TIMER compare 2 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_MTCMP3                           BIT(6)              /*!< Master_TIMER compare 3 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST0RST                           BIT(7)              /*!< Slave_TIMER0 reset event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST0REP                           BIT(8)              /*!< Slave_TIMER0 repetition event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST0CMP0                          BIT(9)              /*!< Slave_TIMER0 compare 0 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST0CMP1                          BIT(10)             /*!< Slave_TIMER0 compare 1 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST1RST                           BIT(11)             /*!< Slave_TIMER1 reset event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST1REP                           BIT(12)             /*!< Slave_TIMER1 repetition event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST1CMP0                          BIT(13)             /*!< Slave_TIMER1 compare 0 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST1CMP1                          BIT(14)             /*!< Slave_TIMER1 compare 1 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST2RST                           BIT(15)             /*!< Slave_TIMER2 reset event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST2REP                           BIT(16)             /*!< Slave_TIMER2 repetition event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST2CMP0                          BIT(17)             /*!< Slave_TIMER2 compare 0 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST2CMP1                          BIT(18)             /*!< Slave_TIMER2 compare 1 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST3RST                           BIT(19)             /*!< Slave_TIMER3 reset event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST3REP                           BIT(20)             /*!< Slave_TIMER3 repetition event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST3CMP0                          BIT(21)             /*!< Slave_TIMER3 compare 0 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST3CMP1                          BIT(22)             /*!< Slave_TIMER3 compare 1 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST4RST                           BIT(23)             /*!< Slave_TIMER4 reset event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST4REP                           BIT(24)             /*!< Slave_TIMER4 repetition event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST4CMP0                          BIT(25)             /*!< Slave_TIMER4 compare 0 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST4CMP1                          BIT(26)             /*!< Slave_TIMER4 compare 1 event triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST0EXEV6                         BIT(27)             /*!< Slave_TIMER0 period event following external event 6 triggers bunch mode operation */
#define SHRTIMER_BMSTRG_ST3EXEV7                         BIT(28)             /*!< Slave_TIMER3 period event following external event 7 triggers bunch mode operation */
#define SHRTIMER_BMSTRG_EXEV6                            BIT(29)             /*!< external event 6 triggers bunch mode operation */
#define SHRTIMER_BMSTRG_EXEV7                            BIT(30)             /*!< external event 7 triggers bunch mode operation */
#define SHRTIMER_BMSTRG_CISGN                            BIT(31)             /*!< chip internal signal triggers bunch mode operation */

/* SHRTIMER_BMCMPV */
#define SHRTIMER_BMCMPV_BMCMPVAL                         BITS(0,15)          /*!< bunch mode compare value */

/* SHRTIMER_BMCAR */
#define SHRTIMER_BMCAR_BMCARL                            BITS(0,15)          /*!< bunch mode counter auto reload value */

