GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_shrtimer.h
/* SHRTIMER_ADCTRIGS1 */
#define SHRTIMER_ADCTRIGS1_TRG1MTC0                      BIT(0)              /*!< SHRTIMER_ADCTRIG1 on Master_TIMER compare 0 event */
#define SHRTIMER_ADCTRIGS1_TRG1MTC1                      BIT(1)              /*!< SHRTIMER_ADCTRIG1 on Master_TIMER compare 1 event */
#define SHRTIMER_ADCTRIGS1_TRG1MTC2                      BIT(2)              /*!< SHRTIMER_ADCTRIG1 on Master_TIMER compare 2 event */
#define SHRTIMER_ADCTRIGS1_TRG1MTC3                      BIT(3)              /*!< SHRTIMER_ADCTRIG1 on Master_TIMER compare 3 event */
#define SHRTIMER_ADCTRIGS1_TRG1MTPER                     BIT(4)              /*!< SHRTIMER_ADCTRIG1 on Master_TIMER period event */
#define SHRTIMER_ADCTRIGS1_TRG1EXEV5                     BIT(5)              /*!< SHRTIMER_ADCTRIG1 on external event 5 */
#define SHRTIMER_ADCTRIGS1_TRG1EXEV6                     BIT(6)              /*!< SHRTIMER_ADCTRIG1 on external event 6 */
#define SHRTIMER_ADCTRIGS1_TRG1EXEV7                     BIT(7)              /*!< SHRTIMER_ADCTRIG1 on external event 7 */
#define SHRTIMER_ADCTRIGS1_TRG1EXEV8                     BIT(8)              /*!< SHRTIMER_ADCTRIG1 on external event 8 */
#define SHRTIMER_ADCTRIGS1_TRG1EXEV9                     BIT(9)              /*!< SHRTIMER_ADCTRIG1 on external event 9 */
#define SHRTIMER_ADCTRIGS1_TRG1ST0C1                     BIT(10)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER0 compare 1 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST0C2                     BIT(11)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER0 compare 2 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST0C3                     BIT(12)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER0 compare 3 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST0PER                    BIT(13)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER0 period event */
#define SHRTIMER_ADCTRIGS1_TRG1ST1C1                     BIT(14)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER1 compare 1 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST1C2                     BIT(15)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER1 compare 2 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST1C3                     BIT(16)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER1 compare 3 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST1PER                    BIT(17)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER1 period event */
#define SHRTIMER_ADCTRIGS1_TRG1ST2C1                     BIT(18)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER2 compare 1 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST2C2                     BIT(19)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER2 compare 2 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST2C3                     BIT(20)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER2 compare 3 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST2PER                    BIT(21)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER2 period event */
#define SHRTIMER_ADCTRIGS1_TRG1ST2RST                    BIT(22)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER2 reset and counter roll-over event */
#define SHRTIMER_ADCTRIGS1_TRG1ST3C1                     BIT(23)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER3 compare 1 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST3C2                     BIT(24)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER3 compare 2 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST3C3                     BIT(25)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER3 compare 3 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST3PER                    BIT(26)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER3 period event */
#define SHRTIMER_ADCTRIGS1_TRG1ST3RST                    BIT(27)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER3 reset and counter roll-over event */
#define SHRTIMER_ADCTRIGS1_TRG1ST4C1                     BIT(28)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER4 compare 1 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST4C2                     BIT(29)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER4 compare 2 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST4C3                     BIT(30)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER4 compare 3 event */
#define SHRTIMER_ADCTRIGS1_TRG1ST4RST                    BIT(31)             /*!< SHRTIMER_ADCTRIG1 on Slave_TIMER4 reset and counter roll-over event */

/* SHRTIMER_ADCTRIGS2 */
#define SHRTIMER_ADCTRIGS2_TRG2MTC0                      BIT(0)              /*!< SHRTIMER_ADCTRIG2 on Master_TIMER compare 0 event */
#define SHRTIMER_ADCTRIGS2_TRG2MTC1                      BIT(1)              /*!< SHRTIMER_ADCTRIG2 on Master_TIMER compare 1 event */
#define SHRTIMER_ADCTRIGS2_TRG2MTC2                      BIT(2)              /*!< SHRTIMER_ADCTRIG2 on Master_TIMER compare 2 event */
#define SHRTIMER_ADCTRIGS2_TRG2MTC3                      BIT(3)              /*!< SHRTIMER_ADCTRIG2 on Master_TIMER compare 3 event */
#define SHRTIMER_ADCTRIGS2_TRG2MTPER                     BIT(4)              /*!< SHRTIMER_ADCTRIG2 on Master_TIMER period event */
#define SHRTIMER_ADCTRIGS2_TRG2EXEV0                     BIT(5)              /*!< SHRTIMER_ADCTRIG2 on external event 0 */
#define SHRTIMER_ADCTRIGS2_TRG2EXEV1                     BIT(6)              /*!< SHRTIMER_ADCTRIG2 on external event 1 */
#define SHRTIMER_ADCTRIGS2_TRG2EXEV2                     BIT(7)              /*!< SHRTIMER_ADCTRIG2 on external event 2 */
#define SHRTIMER_ADCTRIGS2_TRG2EXEV3                     BIT(8)              /*!< SHRTIMER_ADCTRIG2 on external event 3 */
#define SHRTIMER_ADCTRIGS2_TRG2EXEV4                     BIT(9)              /*!< SHRTIMER_ADCTRIG2 on external event 4 */
#define SHRTIMER_ADCTRIGS2_TRG2ST0C1                     BIT(10)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER0 compare 1 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST0C2                     BIT(11)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER0 compare 2 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST0C3                     BIT(12)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER0 compare 3 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST0PER                    BIT(13)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER0 period event */
#define SHRTIMER_ADCTRIGS2_TRG2ST0RST                    BIT(14)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER0 reset and counter roll-over event */
#define SHRTIMER_ADCTRIGS2_TRG2ST1C1                     BIT(15)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER1 compare 1 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST1C2                     BIT(16)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER1 compare 2 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST1C3                     BIT(17)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER1 compare 3 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST1PER                    BIT(18)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER1 period event */
#define SHRTIMER_ADCTRIGS2_TRG2ST1RST                    BIT(19)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER1 reset and counter roll-over event */
#define SHRTIMER_ADCTRIGS2_TRG2ST2C1                     BIT(20)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER2 compare 1 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST2C2                     BIT(21)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER2 compare 2 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST2C3                     BIT(22)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER2 compare 3 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST2PER                    BIT(23)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER2 period event */
#define SHRTIMER_ADCTRIGS2_TRG2ST3C1                     BIT(24)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER3 compare 1 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST3C2                     BIT(25)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER3 compare 2 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST3C3                     BIT(26)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER3 compare 3 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST3PER                    BIT(27)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER3 period event */
#define SHRTIMER_ADCTRIGS2_TRG2ST4C1                     BIT(28)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER4 compare 1 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST4C2                     BIT(29)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER4 compare 2 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST4C3                     BIT(30)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER4 compare 3 event */
#define SHRTIMER_ADCTRIGS2_TRG2ST4PER                    BIT(31)             /*!< SHRTIMER_ADCTRIG2 on Slave_TIMER4 period event */

/* SHRTIMER_ADCTRIGS3 */
#define SHRTIMER_ADCTRIGS3_TRG3MTC0                      BIT(0)              /*!< SHRTIMER_ADCTRIG3 on Master_TIMER compare 0 event */
#define SHRTIMER_ADCTRIGS3_TRG3MTC1                      BIT(1)              /*!< SHRTIMER_ADCTRIG3 on Master_TIMER compare 1 event */
#define SHRTIMER_ADCTRIGS3_TRG3MTC2                      BIT(2)              /*!< SHRTIMER_ADCTRIG3 on Master_TIMER compare 2 event */
#define SHRTIMER_ADCTRIGS3_TRG3MTC3                      BIT(3)              /*!< SHRTIMER_ADCTRIG3 on Master_TIMER compare 3 event */
#define SHRTIMER_ADCTRIGS3_TRG3MTPER                     BIT(4)              /*!< SHRTIMER_ADCTRIG3 on Master_TIMER period event */
#define SHRTIMER_ADCTRIGS3_TRG3EXEV5                     BIT(5)              /*!< SHRTIMER_ADCTRIG3 on external event 5 */
#define SHRTIMER_ADCTRIGS3_TRG3EXEV6                     BIT(6)              /*!< SHRTIMER_ADCTRIG3 on external event 6 */
#define SHRTIMER_ADCTRIGS3_TRG3EXEV7                     BIT(7)              /*!< SHRTIMER_ADCTRIG3 on external event 7 */
#define SHRTIMER_ADCTRIGS3_TRG3EXEV8                     BIT(8)              /*!< SHRTIMER_ADCTRIG3 on external event 8 */
#define SHRTIMER_ADCTRIGS3_TRG3EXEV9                     BIT(9)              /*!< SHRTIMER_ADCTRIG3 on external event 9 */
#define SHRTIMER_ADCTRIGS3_TRG3ST0C1                     BIT(10)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER0 compare 1 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST0C2                     BIT(11)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER0 compare 2 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST0C3                     BIT(12)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER0 compare 3 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST0PER                    BIT(13)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER0 period event */
#define SHRTIMER_ADCTRIGS3_TRG3ST1C1                     BIT(14)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER1 compare 1 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST1C2                     BIT(15)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER1 compare 2 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST1C3                     BIT(16)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER1 compare 3 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST1PER                    BIT(17)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER1 period event */
#define SHRTIMER_ADCTRIGS3_TRG3ST2C1                     BIT(18)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER2 compare 1 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST2C2                     BIT(19)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER2 compare 2 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST2C3                     BIT(20)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER2 compare 3 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST2PER                    BIT(21)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER2 period event */
#define SHRTIMER_ADCTRIGS3_TRG3ST2RST                    BIT(22)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER2 reset and counter roll-over event */
#define SHRTIMER_ADCTRIGS3_TRG3ST3C1                     BIT(23)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER3 compare 1 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST3C2                     BIT(24)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER3 compare 2 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST3C3                     BIT(25)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER3 compare 3 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST3PER                    BIT(26)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER3 period event */
#define SHRTIMER_ADCTRIGS3_TRG3ST3RST                    BIT(27)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER3 reset and counter roll-over event */
#define SHRTIMER_ADCTRIGS3_TRG3ST4C1                     BIT(28)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER4 compare 1 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST4C2                     BIT(29)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER4 compare 2 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST4C3                     BIT(30)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER4 compare 3 event */
#define SHRTIMER_ADCTRIGS3_TRG3ST4RST                    BIT(31)             /*!< SHRTIMER_ADCTRIG3 on Slave_TIMER4 reset and counter roll-over event */

/* SHRTIMER_DLLCCTL */
#define SHRTIMER_DLLCCTL_CLBSTRT                         BIT(0)              /*!< DLL calibration start once */
#define SHRTIMER_DLLCCTL_CLBPEREN                        BIT(1)              /*!< DLL periodic calibration enable */
#define SHRTIMER_DLLCCTL_CLBPER                          BITS(2,3)           /*!< DLL calibration period */

/* SHRTIMER_FLTINCFG0 */
#define SHRTIMER_FLTINCFG0_FLT0INEN                      BIT(0)              /*!< fault 0 input enable */
#define SHRTIMER_FLTINCFG0_FLT0INP                       BIT(1)              /*!< fault 0 input polarity */
#define SHRTIMER_FLTINCFG0_FLT0INSRC                     BIT(2)              /*!< fault 0 input source */
#define SHRTIMER_FLTINCFG0_FLT0INFC                      BITS(3,6)           /*!< fault 0 input filter control */
#define SHRTIMER_FLTINCFG0_FLT0INPROT                    BIT(7)              /*!< protect fault 0 input configuration */
#define SHRTIMER_FLTINCFG0_FLT1INEN                      BIT(8)              /*!< fault 1 input enable */
#define SHRTIMER_FLTINCFG0_FLT1INP                       BIT(9)              /*!< fault 1 input polarity */
#define SHRTIMER_FLTINCFG0_FLT1INSRC                     BIT(10)             /*!< fault 1 input source */
#define SHRTIMER_FLTINCFG0_FLT1INFC                      BITS(11,14)         /*!< fault 1 input filter control */
#define SHRTIMER_FLTINCFG0_FLT1INPROT                    BIT(15)             /*!< protect fault 1 input configuration */
#define SHRTIMER_FLTINCFG0_FLT2INEN                      BIT(16)             /*!< fault 2 input enable */
#define SHRTIMER_FLTINCFG0_FLT2INP                       BIT(17)             /*!< fault 2 input polarity */
#define SHRTIMER_FLTINCFG0_FLT2INSRC                     BIT(18)             /*!< fault 2 input source */
#define SHRTIMER_FLTINCFG0_FLT2INFC                      BITS(19,22)         /*!< fault 2 input filter control */
#define SHRTIMER_FLTINCFG0_FLT2INPROT                    BIT(23)             /*!< protect fault 2 input configuration */
#define SHRTIMER_FLTINCFG0_FLT3INEN                      BIT(24)             /*!< fault 3 input enable */
#define SHRTIMER_FLTINCFG0_FLT3INP                       BIT(25)             /*!< fault 3 input polarity */
#define SHRTIMER_FLTINCFG0_FLT3INSRC                     BIT(26)             /*!< fault 3 input source */
#define SHRTIMER_FLTINCFG0_FLT3INFC                      BITS(27,30)         /*!< fault 3 input filter control */
#define SHRTIMER_FLTINCFG0_FLT3INPROT                    BIT(31)             /*!< protect fault 3 input configuration */

