GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_shrtimer.h
/* external event filter mode */
#define SHRTIMER_EXEVFILTER_DISABLE                      ((uint32_t)0x00000000U)                                 /* filter mode disable */   
#define SHRTIMER_EXEVFILTER_BLANKINGCMP0                 ((uint32_t)0x00000002U)                                 /*!< blanking mode. the blank is from counter reset/roll-over to SHRTIMER_STxCMP0V */
#define SHRTIMER_EXEVFILTER_BLANKINGCMP1                 ((uint32_t)0x00000004U)                                 /*!< blanking mode. the blank is from counter reset/roll-over to SHRTIMER_STxCMP1V */
#define SHRTIMER_EXEVFILTER_BLANKINGCMP2                 ((uint32_t)0x00000006U)                                 /*!< blanking mode. the blank is from counter reset/roll-over to SHRTIMER_STxCMP2V */
#define SHRTIMER_EXEVFILTER_BLANKINGCMP3                 ((uint32_t)0x00000008U)                                 /*!< blanking mode. the blank is from counter reset/roll-over to SHRTIMER_STxCMP3V */
#define SHRTIMER_EXEVFILTER_BLANKINGSRC0                 ((uint32_t)0x0000000AU)                                 /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC0 */
#define SHRTIMER_EXEVFILTER_BLANKINGSRC1                 ((uint32_t)0x0000000CU)                                 /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC1 */
#define SHRTIMER_EXEVFILTER_BLANKINGSRC2                 ((uint32_t)0x0000000EU)                                 /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC2 */
#define SHRTIMER_EXEVFILTER_BLANKINGSRC3                 ((uint32_t)0x00000010U)                                 /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC3 */
#define SHRTIMER_EXEVFILTER_BLANKINGSRC4                 ((uint32_t)0x00000012U)                                 /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC4 */
#define SHRTIMER_EXEVFILTER_BLANKINGSRC5                 ((uint32_t)0x00000014U)                                 /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC5 */
#define SHRTIMER_EXEVFILTER_BLANKINGSRC6                 ((uint32_t)0x00000016U)                                 /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC6 */
#define SHRTIMER_EXEVFILTER_BLANKINGSRC7                 ((uint32_t)0x00000018U)                                 /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC7 */
#define SHRTIMER_EXEVFILTER_WINDOWINGCMP1                ((uint32_t)0x0000001AU)                                 /*!< windowing mode. the windowing is from counter reset/roll-over to SHRTIMER_STxCMP1V */
#define SHRTIMER_EXEVFILTER_WINDOWINGCMP2                ((uint32_t)0x0000001CU)                                 /*!< windowing mode. the windowing is from counter reset/roll-over to SHRTIMER_STxCMP2V */
#define SHRTIMER_EXEVFILTER_WINDOWINGSRC                 ((uint32_t)0x0000001EU)                                 /*!< windowing mode. the windowing is from other Slave_TIMERy(not Slave_TIMERx):STWDSRC */

/* external event memorized enable */
#define SHRTIMER_EXEVMEMORIZED_DISABLE                   ((uint32_t)0x00000000U)                                 /*!< external event memory disable */
#define SHRTIMER_EXEVMEMORIZED_ENABLE                    (SHRTIMER_STXEXEVFCFG0_EXEV0MEEN)                        /*!< external event memory  enable. the memorized event is generated as soon as the blanking period or windowing period is completed */

/* dead time prescaler */
#define SHRTIMER_DEADTIME_PRESCALER_MUL64                ((uint32_t)0x0000000AU)                                 /*!< fSHRTIMER_DTGCK = 64* fSHRTIMER_CK */
#define SHRTIMER_DEADTIME_PRESCALER_MUL32                ((uint32_t)0x00000009U)                                 /*!< fSHRTIMER_DTGCK = 32* fSHRTIMER_CK */
#define SHRTIMER_DEADTIME_PRESCALER_MUL16                ((uint32_t)0x00000008U)                                 /*!< fSHRTIMER_DTGCK = 16* fSHRTIMER_CK */
#define SHRTIMER_DEADTIME_PRESCALER_MUL8                 ((uint32_t)0x00000000U)                                 /*!< fSHRTIMER_DTGCK = 8*fSHRTIMER_CK */
#define SHRTIMER_DEADTIME_PRESCALER_MUL4                 ((uint32_t)0x00000001U)                                 /*!< fSHRTIMER_DTGCK = (8*fSHRTIMER_CK)/2 = 4*fSHRTIMER_CK */
#define SHRTIMER_DEADTIME_PRESCALER_MUL2                 ((uint32_t)0x00000002U)                                 /*!< fSHRTIMER_DTGCK = (8*fSHRTIMER_CK)/4 = 2*fSHRTIMER_CK */
#define SHRTIMER_DEADTIME_PRESCALER_DIV1                 ((uint32_t)0x00000003U)                                 /*!< fSHRTIMER_DTGCK = (8*fSHRTIMER_CK)/8 = fSHRTIMER_CK*/
#define SHRTIMER_DEADTIME_PRESCALER_DIV2                 ((uint32_t)0x00000004U)                                 /*!< fSHRTIMER_DTGCK = (8*fSHRTIMER_CK)/16 = fSHRTIMER_CK / 2 */
#define SHRTIMER_DEADTIME_PRESCALER_DIV4                 ((uint32_t)0x00000005U)                                 /*!< fSHRTIMER_DTGCK = (8*fSHRTIMER_CK)/32 = fSHRTIMER_CK / 4 */
#define SHRTIMER_DEADTIME_PRESCALER_DIV8                 ((uint32_t)0x00000006U)                                 /*!< fSHRTIMER_DTGCK = (8*fSHRTIMER_CK)/64 = fSHRTIMER_CK / 8 */
#define SHRTIMER_DEADTIME_PRESCALER_DIV16                ((uint32_t)0x00000007U)                                 /*!< fSHRTIMER_DTGCK = (8*fSHRTIMER_CK)/128 = fSHRTIMER_CK / 16 */

/* dead time rising sign */
#define SHRTIMER_DEADTIME_RISINGSIGN_POSITIVE            ((uint32_t)0x00000000U)                                 /*!< the sign of rising edge dead-time value is positive */
#define SHRTIMER_DEADTIME_RISINGSIGN_NEGATIVE            (SHRTIMER_STXDTCTL_DTRS)                                 /*!< the sign of rising edge dead-time value is negative */

/* dead time rising edge protection for value and sign */
#define SHRTIMER_DEADTIME_RISING_PROTECT_DISABLE         ((uint32_t)0x00000000U)                                 /*!< protect disable. DTRS and DTRCFG[15:0] register are writable */
#define SHRTIMER_DEADTIME_RISING_PROTECT_ENABLE          (SHRTIMER_STXDTCTL_DTRSVPROT)                            /*!< protect enable. DTRS and DTRCFG[15:0] are read-only */

/* dead time rising edge protection only for sign */
#define SHRTIMER_DEADTIME_RISINGSIGN_PROTECT_DISABLE     ((uint32_t)0x00000000U)                                 /*!< protect disable. DTRS bit is writable */
#define SHRTIMER_DEADTIME_RISINGSIGN_PROTECT_ENABLE      (SHRTIMER_STXDTCTL_DTRSPROT)                             /*!< protect enable. DTRS bit is read-only */

/* dead time falling sign */
#define SHRTIMER_DEADTIME_FALLINGSIGN_POSITIVE           ((uint32_t)0x00000000U)                                 /*!< the sign of falling edge dead-time value is positive */
#define SHRTIMER_DEADTIME_FALLINGSIGN_NEGATIVE           (SHRTIMER_STXDTCTL_DTFS)                                 /*!< the sign of falling edge dead-time value is negative */

