GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_shrtimer.h
/* DLL calibration control */
#define SHRTIMER_CALIBRATION_ONCE                        ((uint32_t)0x88888888U)                                 /*!< DLL calibration start once */               
#define SHRTIMER_CALIBRATION_1048576_PERIOD              ((uint32_t)0x00000000U)                                 /*!< 1048576 * tSHRTIMER_CK */
#define SHRTIMER_CALIBRATION_131072_PERIOD               ((uint32_t)0x00000004U)                                 /*!< 131072 * tSHRTIMER_CK */
#define SHRTIMER_CALIBRATION_16384_PERIOD                ((uint32_t)0x00000008U)                                 /*!< 16384 * tSHRTIMER_CK  */
#define SHRTIMER_CALIBRATIO_2048_PERIOD                  ((uint32_t)0x0000000CU)                                 /*!< 2048 * tSHRTIMER_CK */

/* Master_TIMER and Slave_TIMER interrupt enable or disable */
#define SHRTIMER_MT_ST_INT_CMP0                          SHRTIMER_STXDMAINTEN_CMP0IE                              /*!< compare 0 interrupt */
#define SHRTIMER_MT_ST_INT_CMP1                          SHRTIMER_STXDMAINTEN_CMP1IE                              /*!< compare 1 interrupt */
#define SHRTIMER_MT_ST_INT_CMP2                          SHRTIMER_STXDMAINTEN_CMP2IE                              /*!< compare 2 interrupt */
#define SHRTIMER_MT_ST_INT_CMP3                          SHRTIMER_STXDMAINTEN_CMP3IE                              /*!< compare 3 interrupt */
#define SHRTIMER_MT_ST_INT_REP                           SHRTIMER_STXDMAINTEN_REPIE                               /*!< repetition interrupt */
#define SHRTIMER_MT_INT_SYNI                             SHRTIMER_MTDMAINTEN_SYNIIE                               /*!< synchronization input interrupt */
#define SHRTIMER_MT_ST_INT_UPD                           SHRTIMER_STXDMAINTEN_UPIE                                /*!< update interrupt */
#define SHRTIMER_ST_INT_CAP0                             SHRTIMER_STXDMAINTEN_CAP0IE                              /*!< capture 0 interrupt */
#define SHRTIMER_ST_INT_CAP1                             SHRTIMER_STXDMAINTEN_CAP1IE                              /*!< capture 1 interrupt */
#define SHRTIMER_ST_INT_CH0OA                            SHRTIMER_STXDMAINTEN_CH0OAIE                             /*!< channel 0 output active interrupt */
#define SHRTIMER_ST_INT_CH0ONA                           SHRTIMER_STXDMAINTEN_CH0ONAIE                            /*!< channel 0 output inactive interrupt */
#define SHRTIMER_ST_INT_CH1OA                            SHRTIMER_STXDMAINTEN_CH1OAIE                             /*!< channel 1 output active interrupt */
#define SHRTIMER_ST_INT_CH1ONA                           SHRTIMER_STXDMAINTEN_CH1ONAIE                            /*!< channel 1 output inactive interrupt */
#define SHRTIMER_ST_INT_CNTRST                           SHRTIMER_STXDMAINTEN_RSTIE                               /*!< counter reset interrupt */
#define SHRTIMER_ST_INT_DLYIDLE                          SHRTIMER_STXDMAINTEN_DLYIIE                              /*!< delayed IDLE mode entry interrupt */

/* SHRTIMER common interrupt */
#define SHRTIMER_INT_SYSFLT                              SHRTIMER_INTEN_SYSFLTIE                                  /*!< system fault interrupt */
#define SHRTIMER_INT_DLLCAL                              SHRTIMER_INTEN_DLLCALIE                                  /*!< DLL calibration completed interrupt */
#define SHRTIMER_INT_BMPER                               SHRTIMER_INTEN_BMPERIE                                   /*!< bunch mode period interrupt */

/* Master_TIMER and Slave_TIMER interrupt flag */
#define SHRTIMER_MT_ST_INT_FLAG_CMP0                     SHRTIMER_STXINTF_CMP0IF                                  /*!< compare 0 interrupt flag */
#define SHRTIMER_MT_ST_INT_FLAG_CMP1                     SHRTIMER_STXINTF_CMP1IF                                  /*!< compare 1 interrupt flag */
#define SHRTIMER_MT_ST_INT_FLAG_CMP2                     SHRTIMER_STXINTF_CMP2IF                                  /*!< compare 2 interrupt flag */
#define SHRTIMER_MT_ST_INT_FLAG_CMP3                     SHRTIMER_STXINTF_CMP3IF                                  /*!< compare 3 interrupt flag */
#define SHRTIMER_MT_ST_INT_FLAG_REP                      SHRTIMER_STXINTF_REPIF                                   /*!< repetition interrupt flag */
#define SHRTIMER_MT_INT_FLAG_SYNI                        SHRTIMER_MTINTF_SYNIIF                                   /*!< synchronization input interrupt flag */
#define SHRTIMER_MT_ST_INT_FLAG_UPD                      SHRTIMER_STXINTF_UPIF                                    /*!< update interrupt flag */
#define SHRTIMER_ST_INT_FLAG_CAP0                        SHRTIMER_STXINTF_CAP0IF                                  /*!< capture 0 interrupt flag */
#define SHRTIMER_ST_INT_FLAG_CAP1                        SHRTIMER_STXINTF_CAP1IF                                  /*!< capture 1 interrupt flag */
#define SHRTIMER_ST_INT_FLAG_CH0OA                       SHRTIMER_STXINTF_CH0OAIF                                 /*!< channel 0 output active interrupt flag */
#define SHRTIMER_ST_INT_FLAG_CH0ONA                      SHRTIMER_STXINTF_CH0ONAIF                                /*!< channel 0 output inactive interrupt flag */
#define SHRTIMER_ST_INT_FLAG_CH1OA                       SHRTIMER_STXINTF_CH1OAIF                                 /*!< channel 1 output active interrupt flag */
#define SHRTIMER_ST_INT_FLAG_CH1ONA                      SHRTIMER_STXINTF_CH1ONAIF                                /*!< channel 1 output inactive interrupt flag */
#define SHRTIMER_ST_INT_FLAG_CNTRST                      SHRTIMER_STXINTF_RSTIF                                   /*!< counter reset interrupt flag */
#define SHRTIMER_ST_INT_FLAG_DLYIDLE                     SHRTIMER_STXINTF_DLYIIF                                  /*!< delayed IDLE mode entry interrupt flag */

/* SHRTIMER common interrupt flag */
#define SHRTIMER_INT_FLAG_FLT0                           SHRTIMER_INTF_FLT0IF                                     /*!< fault 0 interrupt flag */
#define SHRTIMER_INT_FLAG_FLT1                           SHRTIMER_INTF_FLT1IF                                     /*!< fault 1 interrupt flag */
#define SHRTIMER_INT_FLAG_FLT2                           SHRTIMER_INTF_FLT2IF                                     /*!< fault 2 interrupt flag */
#define SHRTIMER_INT_FLAG_FLT3                           SHRTIMER_INTF_FLT3IF                                     /*!< fault 3 interrupt flag */
#define SHRTIMER_INT_FLAG_FLT4                           SHRTIMER_INTF_FLT4IF                                     /*!< fault 4 interrupt flag */
#define SHRTIMER_INT_FLAG_SYSFLT                         SHRTIMER_INTF_SYSFLTIF                                   /*!< system fault interrupt flag */
#define SHRTIMER_INT_FLAG_DLLCAL                         SHRTIMER_INTF_DLLCALIF                                   /*!< DLL calibration completed interrupt flag */
#define SHRTIMER_INT_FLAG_BMPER                          SHRTIMER_INTF_BMPERIF                                    /*!< bunch mode period interrupt flag */

/* Master_TIMER and Slave_TIMER flag */
#define SHRTIMER_MT_ST_FLAG_CMP0                         SHRTIMER_STXINTF_CMP0IF                                  /*!< compare 0 flag */
#define SHRTIMER_MT_ST_FLAG_CMP1                         SHRTIMER_STXINTF_CMP1IF                                  /*!< compare 1 flag */
#define SHRTIMER_MT_ST_FLAG_CMP2                         SHRTIMER_STXINTF_CMP2IF                                  /*!< compare 2 flag */
#define SHRTIMER_MT_ST_FLAG_CMP3                         SHRTIMER_STXINTF_CMP3IF                                  /*!< compare 3 flag */
#define SHRTIMER_MT_ST_FLAG_REP                          SHRTIMER_STXINTF_REPIF                                   /*!< repetition flag */
#define SHRTIMER_MT_FLAG_SYNI                            SHRTIMER_MTINTF_SYNIIF                                   /*!< synchronization input flag */
#define SHRTIMER_MT_ST_FLAG_UPD                          SHRTIMER_STXINTF_UPIF                                    /*!< update flag */
#define SHRTIMER_ST_FLAG_CAP0                            SHRTIMER_STXINTF_CAP0IF                                  /*!< capture 0 flag */
#define SHRTIMER_ST_FLAG_CAP1                            SHRTIMER_STXINTF_CAP1IF                                  /*!< capture 1 flag */
#define SHRTIMER_ST_FLAG_CH0OA                           SHRTIMER_STXINTF_CH0OAIF                                 /*!< channel 0 output active flag */
#define SHRTIMER_ST_FLAG_CH0ONA                          SHRTIMER_STXINTF_CH0ONAIF                                /*!< channel 0 output inactive flag */
#define SHRTIMER_ST_FLAG_CH1OA                           SHRTIMER_STXINTF_CH1OAIF                                 /*!< channel 1 output active flag */
#define SHRTIMER_ST_FLAG_CH1ONA                          SHRTIMER_STXINTF_CH1ONAIF                                /*!< channel 1 output inactive flag */
#define SHRTIMER_ST_FLAG_CNTRST                          SHRTIMER_STXINTF_RSTIF                                   /*!< counter reset flag */
#define SHRTIMER_ST_FLAG_DLYIDLE                         SHRTIMER_STXINTF_DLYIIF                                  /*!< delayed IDLE mode entry flag */
#define SHRTIMER_ST_FLAG_CBLN                            SHRTIMER_STXINTF_CBLNF                                   /*!< current balanced flag */
#define SHRTIMER_ST_FLAG_BLNIDLE                         SHRTIMER_STXINTF_BLNIF                                   /*!< balanced IDLE flag */
#define SHRTIMER_ST_FLAG_CH0OUT                          SHRTIMER_STXINTF_CH0F                                    /*!< channel 0 output flag */
#define SHRTIMER_ST_FLAG_CH1OUT                          SHRTIMER_STXINTF_CH1F                                    /*!< channel 1 output flag */

/* SHRTIMER common flag */
#define SHRTIMER_FLAG_FLT0                               SHRTIMER_INTF_FLT0IF                                     /*!< fault 0 flag */
#define SHRTIMER_FLAG_FLT1                               SHRTIMER_INTF_FLT1IF                                     /*!< fault 1 flag */
#define SHRTIMER_FLAG_FLT2                               SHRTIMER_INTF_FLT2IF                                     /*!< fault 2 flag */
#define SHRTIMER_FLAG_FLT3                               SHRTIMER_INTF_FLT3IF                                     /*!< fault 3 flag */
#define SHRTIMER_FLAG_FLT4                               SHRTIMER_INTF_FLT4IF                                     /*!< fault 4 flag */
#define SHRTIMER_FLAG_SYSFLT                             SHRTIMER_INTF_SYSFLTIF                                   /*!< system fault flag */
#define SHRTIMER_FLAG_DLLCAL                             SHRTIMER_INTF_DLLCALIF                                   /*!< DLL calibration completed flag */
#define SHRTIMER_FLAG_BMPER                              SHRTIMER_INTF_BMPERIF                                    /*!< bunch mode period flag */

/* Master_TIMER and Slave_TIMER DMA request */
#define SHRTIMER_MT_ST_DMA_CMP0                          SHRTIMER_STXDMAINTEN_CMP0DEN                             /*!< compare 0 DMA request */
#define SHRTIMER_MT_ST_DMA_CMP1                          SHRTIMER_STXDMAINTEN_CMP1DEN                             /*!< compare 1 DMA request */
#define SHRTIMER_MT_ST_DMA_CMP2                          SHRTIMER_STXDMAINTEN_CMP2DEN                             /*!< compare 2 DMA request */
#define SHRTIMER_MT_ST_DMA_CMP3                          SHRTIMER_STXDMAINTEN_CMP3DEN                             /*!< compare 3 DMA request */
#define SHRTIMER_MT_ST_DMA_REP                           SHRTIMER_STXDMAINTEN_REPDEN                              /*!< repetition DMA request */
#define SHRTIMER_MT_DMA_SYNID                            SHRTIMER_MTDMAINTEN_SYNIDEN                              /*!< synchronization input DMA request */
#define SHRTIMER_MT_ST_DMA_UPD                           SHRTIMER_STXDMAINTEN_UPDEN                               /*!< update DMA request */
#define SHRTIMER_ST_DMA_CAP0                             SHRTIMER_STXDMAINTEN_CAP0DEN                             /*!< capture 0 DMA request */
#define SHRTIMER_ST_DMA_CAP1                             SHRTIMER_STXDMAINTEN_CAP1DEN                             /*!< capture 1 DMA request */
#define SHRTIMER_ST_DMA_CH0OA                            SHRTIMER_STXDMAINTEN_CH0OADEN                            /*!< channel 0 output active DMA request */
#define SHRTIMER_ST_DMA_CH0ONA                           SHRTIMER_STXDMAINTEN_CH0ONADEN                           /*!< channel 0 output inactive DMA request */
#define SHRTIMER_ST_DMA_CH1OA                            SHRTIMER_STXDMAINTEN_CH1OADEN                            /*!< channel 1 output active DMA request */
#define SHRTIMER_ST_DMA_CH1ONA                           SHRTIMER_STXDMAINTEN_CH1ONADEN                           /*!< channel 1 output inactive DMA request */
#define SHRTIMER_ST_DMA_CNTRST                           SHRTIMER_STXDMAINTEN_RSTDEN                              /*!< counter reset DMA request */
#define SHRTIMER_ST_DMA_DLYIDLE                          SHRTIMER_STXDMAINTEN_DLYIDEN                             /*!< delay IDLE DMA request */

/* Master_TIMER or Slave_TIMER update by software */
#define SHRTIMER_UPDATE_SW_MT                            (SHRTIMER_CTL1_MTSUP)                                    /*!< Master_TIMER software update */
#define SHRTIMER_UPDATE_SW_ST0                           (SHRTIMER_CTL1_ST0SUP)                                   /*!< Slave_TIMER0 software update */
#define SHRTIMER_UPDATE_SW_ST1                           (SHRTIMER_CTL1_ST1SUP)                                   /*!< Slave_TIMER1 software update */
#define SHRTIMER_UPDATE_SW_ST2                           (SHRTIMER_CTL1_ST2SUP)                                   /*!< Slave_TIMER2 software update */
#define SHRTIMER_UPDATE_SW_ST3                           (SHRTIMER_CTL1_ST3SUP)                                   /*!< Slave_TIMER3 software update */
#define SHRTIMER_UPDATE_SW_ST4                           (SHRTIMER_CTL1_ST4SUP)                                   /*!< Slave_TIMER4 software update */

/* Master_TIMER or Slave_TIMER counter reset by software */
#define SHRTIMER_COUNTER_RESET_SW_MT                     (SHRTIMER_CTL1_MTSRST)                                   /*!< Master_TIMER software reset */
#define SHRTIMER_COUNTER_RESET_SW_ST0                    (SHRTIMER_CTL1_ST0SRST)                                  /*!< Slave_TIMER0 software reset */
#define SHRTIMER_COUNTER_RESET_SW_ST1                    (SHRTIMER_CTL1_ST1SRST)                                  /*!< Slave_TIMER1 software reset */
#define SHRTIMER_COUNTER_RESET_SW_ST2                    (SHRTIMER_CTL1_ST2SRST)                                  /*!< Slave_TIMER2 software reset */
#define SHRTIMER_COUNTER_RESET_SW_ST3                    (SHRTIMER_CTL1_ST3SRST)                                  /*!< Slave_TIMER3 software reset */
#define SHRTIMER_COUNTER_RESET_SW_ST4                    (SHRTIMER_CTL1_ST4SRST)                                  /*!< Slave_TIMER4 software reset */

